import "../../style/Tos.css";
import Footer from "./Footer";
{/*参考サイト https://kiyaku.jp/hinagata/gp.html*/}

export default function Tos() {
  return (
    <div>
      <div class="centermoji">
        <h2>利用規約</h2>
      </div>

      <br />
      <div class="mojimidashi">1.適用</div>
      <hr class="keisen"/>
      <br />
      <div>
        (1)本規約は，ユーザーとの間の本サービスの利用に関わる一切の関係に適用されるものとします。
      </div>
      <br />
      <div>
        (2)本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。
        これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
      </div>
      <br />
      <div>
        (3)本規約の規定が前条の個別規定の規定と矛盾する場合には，
        個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。
      </div>
      <br />
      <div class="mojimidashi">2.利用登録</div>
      <hr class="keisen"/>
      <br />

      <div>
        (1)本サービスにおいては，登録希望者が本規約に同意の上，本サービスの定める方法によって利用登録を申請し，本サービスがこれを承認することによって，利用登録が完了するものとします。
      </div>
      <br />
      <div class="mojimidashi">3.ユーザIDおよびパスワードの管理</div>
      <hr class="keisen"/>
      <br />
      <div>
        (1)ユーザーは、自己の責任において、本サービスのユーザーIDおよびパスワードを適切に管理するものとします。
      </div>
      <br />
      <div>
        (2)ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのユーザーIDを登録しているユーザー自身による利用とみなします。
      </div>
      <br />
      <div>
        (3)ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は、本サービスに故意又は重大な過失がある場合を除き、本サービスは一切の責任を負わないものとします。
      </div>
      <br />
      <div class="mojimidashi">4.禁止事項</div>
      <hr class="keisen"/>
      <br />
      <div>(1)法令または公序良俗に違反する行為</div>
      <br />
      <div>(2)犯罪に関連する行為</div>
      <br />
      <div>
        (3)本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為
      </div>
      <br />
      <div>
        (4)本サービス，ほかのユーザー，またはその他第三者のサーバーまたは
        ネットワークの機能を破壊したり，妨害したりする行為
      </div>
      <br />
      <div>(5)本サービスによって得られた情報を商業的に利用する行為</div>
      <br />
      <div>(6)本サービスの運営を妨害するおそれのある行為</div>
      <br />
      <div>(7)不正アクセスをし，またはこれを試みる行為</div>
      <br />
      <div>(8)他のユーザーに関する個人情報等を収集または蓄積する行為</div>
      <br />
      <div>(9)不正な目的を持って本サービスを利用する行為</div>
      <br />
      <div>
        (10)本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為
      </div>
      <br />
      <div>(11)他のユーザーに成りすます行為</div>
      <br />
      <div>(12)許諾しない本サービス上での宣伝，広告，勧誘，または営業行為</div>
      <br />
      <div>(13)面識のない異性との出会いを目的とした行為</div>
      <br />
      <div>
        (14)サービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
      </div>
      <br />
      <div>(15)その他，本サービスが不適切と判断する行為</div>
      <br />
      <div class="mojimidashi">5.本サービスの停止等</div>
      <hr class="keisen"/>
      <br />
      <div>
        (1)本サービスは，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止
        または中断することができるものとします。
      </div>
      <br />
      <div>
        (2)本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益
        または損害についても，一切の責任を負わないものとします
      </div>
      <br />
      <div class="mojimidashi">6.退会</div>
      <hr class="keisen"/>
      <br />
      <div>
        ユーザーは，本サービスが定める退会手続により，本サービスから退会できるものとします。
      </div>
      <br />
      <div class="mojimidashi">7.個人情報の取り扱い</div>
      <hr class="keisen"/>
      <br />
      <div>
        本サービスの利用によって取得する個人情報については，
        「プライバシーポリシー」に従い適切に取り扱うものとします。
      </div>
      <Footer></Footer>

    </div>
  );
}